{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (village scene, bird character, follow camera, HUD/audio) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-line descriptions of each frontend source file's purpose and contents.",
  "frontend/index.css": "Global Tailwind CSS file defining OKLCH-based design tokens for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "HTML entry point that loads the Press Start 2P pixel font, sets the page title to 'Blue Bird Village', and mounts the React app.",
  "frontend/src/App.tsx": "Root React component that renders the full-screen Village3DScene as the sole UI element.",
  "frontend/src/components/BlueBird.tsx": "Controllable blue bird player character built from BoxGeometry parts with WASD/arrow movement, Space jump, gravity simulation, wing flap animation, and a position callback.",
  "frontend/src/components/FollowCamera.tsx": "Third-person follow camera component that smoothly lerps the Three.js camera behind and above the bird's position each frame.",
  "frontend/src/components/GameHUD.tsx": "Fixed overlay HUD displaying the bird's XYZ coordinates, a mute/unmute music button, control hints, a crosshair, and a footer attribution link.",
  "frontend/src/components/House.tsx": "Minecraft-style house component with a stone foundation, wood-plank walls loaded via TextureLoader, a dark red two-tier roof, door, and glass windows.",
  "frontend/src/components/Sky.tsx": "3D sky component rendering a blue sphere dome, a blocky Minecraft-style sun with a glow ring, and five cloud formations made of white boxes.",
  "frontend/src/components/Terrain.tsx": "Renders a 32x32 grid of instanced box meshes as terrain tiles using a grass-dirt texture with nearest-neighbor filtering.",
  "frontend/src/components/Tree.tsx": "Renders a stylized voxel-style tree with a brown trunk and four layered green leaf tiers using box geometries.",
  "frontend/src/components/Village3DScene.tsx": "Main 3D scene component that composes the village with terrain, path blocks, houses, trees, a controllable BlueBird player, follow camera, lighting, and a HUD with audio controls.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAudio.ts": "React hook that procedurally generates and plays a looping Minecraft-style ambient melody via the Web Audio API, with mute/unmute toggle support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, logout, and identity state to the React component tree.",
  "frontend/src/hooks/useKeyboardControls.ts": "React hook that tracks WASD/arrow key and spacebar input state for player movement controls, preventing default scroll behavior on relevant keys.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module indicating no backend queries are needed since all game state is local.",
  "frontend/src/index.css": "Global stylesheet defining a Minecraft-inspired design system with custom CSS variables, Tailwind layers, and reusable HUD component classes using the Press Start 2P font.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom Minecraft-themed colors (mc-grass, mc-dirt, etc.), pixel font (Press Start 2P), pixel box shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state descriptor for a Minecraft-style 2D/3D game with a blue bird character, tracking schema version, existing features (village scene, player character, camera, HUD, UI theme), required pixel-art images, and architectural notes."
}