{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting the UI button visibility enhancement feature, listing affected files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "JSON document summarizing each frontend source file's purpose, covering components, hooks, styles, and configuration for the Blue Bird Village game.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML entry point that loads the Press Start 2P pixel font from Google Fonts and mounts the React app root for Blue Bird Village.",
  "frontend/src/App.tsx": "Root React component that renders the full-screen Village3DScene as the sole UI element.",
  "frontend/src/components/animals/Chicken.tsx": "Animates a voxel chicken that wanders the terrain with leg-swing and head-bob animations, pausing and changing direction randomly.",
  "frontend/src/components/animals/Cow.tsx": "Renders an animated 3D cow using React Three Fiber box geometries, with autonomous wandering movement, boundary detection, and leg swing animation driven by useFrame.",
  "frontend/src/components/animals/Pig.tsx": "Renders an animated 3D pig using React Three Fiber box geometries, with the same autonomous wandering, boundary detection, and leg animation pattern as the Cow component.",
  "frontend/src/components/BlockHotbar.tsx": "Fixed bottom-center hotbar UI component displaying five selectable block types with Minecraft-styled bevel borders, keyboard shortcuts (1–5), and a highlighted selected state.",
  "frontend/src/components/BlueBird.tsx": "Controllable player character component implementing movement, jumping, gravity, and wing animation by merging keyboard and touch joystick inputs each frame via useFrame.",
  "frontend/src/components/FollowCamera.tsx": "Third-person follow camera that smoothly lerps its position and look-at target behind and above the bird each frame.",
  "frontend/src/components/GameHUD.tsx": "Fixed overlay HUD displaying the game title, bird position coordinates, and a prominently styled mute/unmute music button with color-coded states.",
  "frontend/src/components/House.tsx": "Renders a Minecraft-style 3D house with a stone foundation, wooden walls, a two-tier roof, door, and windows using Three.js box geometries and loaded textures.",
  "frontend/src/components/PlacedBlocks.tsx": "Renders a list of player-placed blocks as individual mesh components, forwarding pointer-down events for interaction.",
  "frontend/src/components/Sky.tsx": "Renders a sky dome, a blocky sun with a glow ring, and several voxel-style cloud groups using Three.js basic materials.",
  "frontend/src/components/Terrain.tsx": "Generates a 32x32 grid of grass-dirt textured terrain blocks using a Three.js InstancedMesh for performance.",
  "frontend/src/components/TouchControls.tsx": "Provides a virtual joystick and action buttons (jump, music toggle, hints) for touch-based movement input on mobile devices.",
  "frontend/src/components/Tree.tsx": "Renders a blocky Minecraft-style tree with a trunk and four layered leaf tiers using box geometries and Lambert materials.",
  "frontend/src/components/Village3DScene.tsx": "Composes the full 3D village scene including terrain, houses, trees, animals, a player-controlled bird, lighting, HUD, touch controls, and block placement.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAudio.ts": "Custom hook that generates a looping Minecraft-style ambient melody via the Web Audio API, exposing mute state and a toggle function.",
  "frontend/src/hooks/useBlockPlacement.ts": "Custom hook managing placed block state with add/remove logic, grid snapping, terrain clamping, and pointer event handlers for left-click breaking and right-click placement on block faces.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useKeyboardControls.ts": "Custom hook that tracks WASD/arrow key and space bar state in a stable ref, updating synchronously on keydown/keyup events for use in animation loops without stale closures.",
  "frontend/src/hooks/useQueries.ts": "Placeholder module indicating no backend queries are needed since all game state is local.",
  "frontend/src/index.css": "Global CSS file that sets up a Minecraft-inspired pixel-art theme using Tailwind, the 'Press Start 2P' font, OKLCH CSS variables for a blocky color palette, and custom component classes like hud-panel, hud-button, mc-action-btn, and hotbar-slot.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for data fetching and InternetIdentityProvider for ICP authentication wrapping the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with Minecraft-inspired colors (mc-grass, mc-dirt, etc.) mapped to OKLCH CSS variables, pixel font families, pixel box-shadows, and accordion keyframe animations.",
  "project_state.json": "Project state metadata file tracking version 13 of a Minecraft-style 3D voxel game with a blue bird character, listing existing features, known issues (bird movement controls not responding), and architectural notes."
}