{
  "kind": "build_request",
  "title": "Make UI buttons more prominent and visible",
  "projectName": "Blue Bird Village",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Increase the visual prominence and visibility of all interactive buttons in the game UI — including the mute/unmute music button in GameHUD.tsx, the TouchControls action buttons (yellow jump, green music, pink hints), and the BlockHotbar slot buttons. Buttons must have clearly legible labels/icons, stronger contrast against the background, a visible border or raised effect, and a hover/active press state (e.g., brightness change or scale). All styling must remain consistent with the existing Minecraft pixel-art theme (Press Start 2P font, earthy/blocky flat UI, stone/earthy color palette).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Make please buttons"
        ]
      },
      "acceptanceCriteria": [
        "The mute/unmute button in GameHUD.tsx is clearly visible with a distinct border, background color, and sufficient padding.",
        "The yellow, green, and pink action buttons in TouchControls.tsx are visually prominent with strong contrast and clearly distinguishable icons.",
        "All hotbar slots in BlockHotbar.tsx have a visible button border and the active slot is highlighted with a bright distinct border.",
        "All buttons display a hover state (e.g., brightness increase) and an active/pressed state (e.g., slight scale down or darker shade).",
        "All button styles remain consistent with the Minecraft pixel-art theme (blocky, flat, Press Start 2P font where text is present)."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "All visual changes must remain consistent with the existing Minecraft pixel-art theme."
  ],
  "nonGoals": [
    "Adding new buttons or UI elements not already present.",
    "Changing button functionality or wiring.",
    "Modifying backend logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}