{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Make UI buttons more prominent and visible",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Increase visual prominence and visibility of all interactive buttons in the game UI (GameHUD mute button, TouchControls action buttons, BlockHotbar slots) with stronger contrast, visible borders, raised effects, and hover/active states while maintaining Minecraft pixel-art theme consistency.",
      "acceptanceCriteria": [
        "The mute/unmute button in GameHUD.tsx is clearly visible with a distinct border, background color, and sufficient padding.",
        "The yellow, green, and pink action buttons in TouchControls.tsx are visually prominent with strong contrast and clearly distinguishable icons.",
        "All hotbar slots in BlockHotbar.tsx have a visible button border and the active slot is highlighted with a bright distinct border.",
        "All buttons display a hover state (e.g., brightness increase) and an active/pressed state (e.g., slight scale down or darker shade).",
        "All button styles remain consistent with the Minecraft pixel-art theme (blocky, flat, Press Start 2P font where text is present)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/GameHUD.tsx",
          "operation": "modify",
          "description": "Enhance the mute/unmute music button styling by adding a distinct visible border (2-3px solid border in stone or dark color), a solid background color (using existing color tokens like stone or dirt brown), increased padding (at least 8-12px), and hover/active states (brightness filter on hover, scale transform on active). Ensure the button text or icon remains legible with strong contrast against the background."
        },
        {
          "path": "frontend/src/components/TouchControls.tsx",
          "operation": "modify",
          "description": "Increase visual prominence of the three action buttons (yellow jump, green music, pink hints) by adding stronger borders (3-4px solid in contrasting colors), enhancing background opacity or adding solid fills, increasing button size if needed for better tap targets, and implementing clear hover/active states (brightness increase on hover, slight scale-down on active press). Ensure button icons/labels are clearly distinguishable with high contrast."
        },
        {
          "path": "frontend/src/components/BlockHotbar.tsx",
          "operation": "modify",
          "description": "Add visible borders to all hotbar slot buttons (2-3px solid border in stone or dark color), enhance the active slot highlight with a brighter and thicker gold/yellow border (4-5px), add hover states to all slots (brightness increase or subtle glow), and implement active/pressed states (slight scale-down or darker shade). Maintain the blocky Minecraft aesthetic with flat colors and sharp edges."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add or enhance global CSS utility classes for button styling that support the Minecraft pixel-art theme, including reusable classes for prominent borders, hover brightness effects, active press transforms, and high-contrast backgrounds. Ensure these utilities use existing OKLCH color tokens (stone, dirt, gold) and maintain consistency with the Press Start 2P font and blocky aesthetic."
        }
      ]
    }
  ]
}